_posts/2015-07-06-IDA调试Android-so记录.html
---
layout: post
title: IDA调试Android-so记录
date: 2015-07-06
categories: 
- 技术
tags: 
- Android
author: tiankai
excerpt: Android IDA 逆向 so
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">ARM架构指令集的分类</h2>
<div class="outline-text-2" id="text-1">
<p>
ARM架构中的指令集大致分为两大类: ARM指令集和Thumb指令集.其中Thumb指令集可以看做ARM指令集的子集.
想了解具体的内容可以看下面的链接:<a href="http://blog.csdn.net/jamestaosh/article/details/4345548">Thumb、ARM指令 状态切换</a>
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">ARM指令集和Thumb指令集的切换</h2>
<div class="outline-text-2" id="text-2">
<p>
在ida进行逆向的过程中,经常会遇到ida的提醒,提醒说我们使用的指令集不对,然后程序就不能继续执行了.
这个时候我们就需要对指令集进行转换.下面是ida的帮助文件中提及的内容:
</p>
<pre class="example">
Since architecture version v4 (introduced in ARM7 cores), ARM processors have a new 16-bit instruction set called Thumb (the original 32-bit set is referred to as "ARM"). Since these two sets have different instruction encodings and can be mixed in one segment, we need a way to specify how to disassemble instructions. For this purpose, IDA uses a virtual segment register named 'T'. If its value is 0, then ARM mode is used. Otherwise, Thumb mode is used. ARM is the default mode. Please note that if you change the value of T register for an area, IDA will destroy all instructions in that area because their disassembly is no longer correct.
</pre>
<p>
所以我们在调试的时候直接使用alt+g的快捷键,调出转换指令集的窗口,然后改变T的值,就可以进行转换了.</p>
</div>
</div>
